---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFields
source: html/20e6ace5-fa95-7705-d8d7-2eb86196e134.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFields Method

Gets all sorting/grouping fields in this ScheduleDefinition.

## Syntax (C#)
```csharp
public IList<ScheduleSortGroupField> GetSortGroupFields()
```

## Returns
A list of all sorting/grouping fields.